


Primeiro passo, configurar a ACL sempre no roteador mais perto dos hosts que pretendo restringir.

Claro! Vou montar uma documenta√ß√£o simples, no estilo profissional, para **configura√ß√£o de uma ACL padr√£o (Standard ACL)** em roteadores Cisco.

---

# üìÑ Documenta√ß√£o T√©cnica

## Configura√ß√£o de ACL Padr√£o (Standard ACL) em Equipamentos Cisco

---

## 1. Objetivo

Configurar uma ACL padr√£o para **permitir o tr√°fego** de uma rede espec√≠fica e **negar o tr√°fego** das demais redes.

---

## 2. Requisitos

- Acesso privilegiado ao roteador (`enable`).
    
- Entrar no modo de configura√ß√£o global (`configure terminal`).
    
- Conhecimento da rede que dever√° ser permitida.
    

---

## 3. Conceitos Importantes

- **Standard ACL** filtra **somente** pelo **endere√ßo IP de origem**.
    
- A ACL deve ser aplicada o mais pr√≥ximo poss√≠vel do **destino**.
    
- **Wildcard Mask** √© usada para definir a faixa de IPs.
    

---

## 4. Comandos

### 4.1 Criar uma ACL num√©rica

```bash
R1(config)# access-list [N√∫mero da ACL] permit [IP] [Wildcard Mask]
R1(config)# access-list [N√∫mero da ACL] deny any
```

**Exemplo**:

```bash
R1(config)# access-list 10 permit 192.168.10.0 0.0.0.255
R1(config)# access-list 10 deny any
```

### 4.2 Criar uma ACL nomeada

```bash
R1(config)# ip access-list standard [Nome da ACL]
R1(config-std-nacl)# permit [IP] [Wildcard Mask]
R1(config-std-nacl)# deny any
```

**Exemplo**:

```bash
R1(config)# ip access-list standard PERMIT-REDE10
R1(config-std-nacl)# permit 192.168.10.0 0.0.0.255
R1(config-std-nacl)# deny any
```

---

## 5. Aplicar a ACL na Interface

Escolha a interface que ir√° controlar o tr√°fego, e aplique a ACL:

```bash
R1(config)# interface [Interface]
R1(config-if)# ip access-group [N√∫mero ou Nome da ACL] [in | out]
```

- `in` ‚Üí tr√°fego que **entra** na interface.
    
- `out` ‚Üí tr√°fego que **sai** pela interface.
    

**Exemplo**:

```bash
R1(config)# interface GigabitEthernet0/0
R1(config-if)# ip access-group 10 in
```

ou

```bash
R1(config)# interface GigabitEthernet0/0
R1(config-if)# ip access-group PERMIT-REDE10 in
```

---

## 6. Verifica√ß√£o

Ap√≥s a configura√ß√£o, verifique se a ACL foi criada e aplicada corretamente:

```bash
show access-lists
show ip interface [Interface]
```

**Exemplo**:

```bash
show access-lists
show ip interface GigabitEthernet0/0
```

Esses comandos mostram quais ACLs est√£o configuradas e associadas √†s interfaces.

---

## 7. Notas

- Sempre lembre que existe um **"deny any" impl√≠cito** ao final da ACL.
    
- Se nenhuma linha `permit` combinar com o pacote, ele ser√° **automaticamente bloqueado**.
    
- Wildcard Masks:
    
    - `0.0.0.0` = corresponde exatamente a um IP espec√≠fico.
        
    - `0.0.0.255` = corresponde a qualquer IP dentro de uma sub-rede /24.
        

---

# üìà Exemplo Pr√°tico de Funcionamento

|Origem|Resultado|
|---|---|
|192.168.10.5|Permitido|
|192.168.10.250|Permitido|
|192.168.11.10|Negado|
|10.1.1.1|Negado|

---

**Quer que eu tamb√©m gere essa documenta√ß√£o j√° formatada em PDF, com imagens ilustrando a aplica√ß√£o da ACL na interface?** üéØ  
Posso mandar pra voc√™ baixar se quiser!