

---

## üìÑ Documenta√ß√£o: Como Criar e Adicionar uma VLAN em Switch Cisco

### üéØ Objetivo

Criar uma VLAN, atribuir um nome a ela e adicion√°-la a uma interface espec√≠fica do switch.

---

### üõ†Ô∏è Pr√©-requisitos

- Acesso ao console do switch (CLI) via terminal ou telnet/SSH.
    
- Privilegios de modo EXEC privilegiado (`enable`).
    
- Interface de rede identificada para atribui√ß√£o da VLAN.
    

---

### üîπ Etapa 1: Acessar o Switch

```bash
Switch> enable
Switch# configure terminal
```

---

### üîπ Etapa 2: Criar a VLAN

```bash
Switch(config)# vlan 10
Switch(config-vlan)# name VENDAS
Switch(config-vlan)# exit
```

> üí° Explica√ß√£o:
> 
> - `vlan 10`: Cria a VLAN de n√∫mero 10.
>     
> - `name VENDAS`: D√° o nome "VENDAS" √† VLAN.
>     

---

### üîπ Etapa 3: Atribuir a VLAN a uma Interface

```bash
Switch(config)# interface FastEthernet0/1
Switch(config-if)# switchport mode access
Switch(config-if)# switchport access vlan 10
Switch(config-if)# exit
```

> üí° Explica√ß√£o:
> 
> - `switchport mode access`: Coloca a interface no modo de acesso.
>     
> - `switchport access vlan 10`: Atribui a VLAN 10 √† interface.
>     

---

### üîπ Etapa 4: (Opcional) Verificar a Configura√ß√£o

```bash
Switch# show vlan brief
```

> Exemplo de sa√≠da esperada:

```
VLAN Name                             Status    Ports
---- -------------------------------- --------- -------------------------------
1    default                          active    Fa0/2, Fa0/3, ...
10   VENDAS                           active    Fa0/1
```

---

### ‚úÖ Pronto!

A VLAN foi criada e atribu√≠da a uma porta de acesso.

Se quiser, posso complementar com:

- Como criar VLANs em trunk.
    
- Como aplicar isso via Ansible.
    
- Como salvar a configura√ß√£o (`write memory` ou `copy run start`).
    

Quer que eu coloque tudo isso em um PDF?