
---

## üìÑ Documenta√ß√£o: Como Configurar o Modo Trunk em um Switch Cisco

### üéØ Objetivo

Configurar uma interface de switch para operar em modo **trunk**, permitindo a passagem de m√∫ltiplas VLANs por um √∫nico link.

---

### üõ†Ô∏è Pr√©-requisitos

- Dois switches conectados entre si.
    
- Acesso ao CLI de pelo menos um dos switches.
    
- VLANs j√° criadas (ou ser√£o propagadas via VTP, se habilitado).
    
- Privilegios de modo EXEC privilegiado (`enable`).
    

---

### üîπ Etapa 1: Acessar o Switch

```bash
Switch> enable
Switch# configure terminal
```

---

### üîπ Etapa 2: Entrar na Interface que ser√° Trunk

```bash
Switch(config)# interface FastEthernet0/24
```

---

### üîπ Etapa 3: Configurar o Modo Trunk

```bash
Switch(config-if)# switchport mode trunk
Switch(config-if)# switchport trunk encapsulation dot1q
```

> ‚ö†Ô∏è **Aten√ß√£o**:
> 
> - Alguns switches mais modernos j√° utilizam somente **802.1Q (dot1q)** e n√£o aceitam `isl`.
>     
> - Em switches que n√£o suportam encapsulamento configur√°vel, o comando `switchport trunk encapsulation dot1q` pode n√£o ser necess√°rio.
>     

---

### üîπ Etapa 4: (Opcional) Permitir VLANs Espec√≠ficas no Trunk

```bash
Switch(config-if)# switchport trunk allowed vlan 10,20,30
```

> üí° Isso restringe o trunk para passar apenas as VLANs 10, 20 e 30.

---

### üîπ Etapa 5: (Opcional) Definir VLAN Nativa

```bash
Switch(config-if)# switchport trunk native vlan 99
```

> A VLAN nativa √© a usada para quadros **sem tag VLAN**.

---

### üîπ Etapa 6: Sair e Salvar Configura√ß√£o

```bash
Switch(config-if)# exit
Switch(config)# end
Switch# write memory
```

---

### üîç Etapa 7: Verifica√ß√£o

```bash
Switch# show interfaces trunk
```

> Exemplo de sa√≠da:

```
Port        Mode         Encapsulation  Status        Native vlan
Fa0/24      on           802.1q         trunking      99

Port        Vlans allowed on trunk
Fa0/24      10,20,30

Port        Vlans in spanning tree forwarding state and not pruned
Fa0/24      10,20,30
```

---

### ‚úÖ Pronto!

Agora a interface est√° configurada como **trunk**, permitindo o tr√°fego de m√∫ltiplas VLANs.

Se quiser, posso montar essa documenta√ß√£o em PDF tamb√©m. Deseja isso? E quer um exemplo pr√°tico com dois switches no EVE-NG?