## (Dynamic Trunk Protocol)

---

# üìò Documenta√ß√£o: Configura√ß√£o do Protocolo DTP (Dynamic Trunking Protocol)

## ‚úÖ O que √© o DTP?

O **DTP (Dynamic Trunking Protocol)** √© um protocolo propriet√°rio da Cisco utilizado para negociar dinamicamente o encapsulamento e o estado da porta (acesso ou trunk) entre switches.

> ‚ö†Ô∏è **Aten√ß√£o**: DTP s√≥ funciona entre dispositivos Cisco e deve ser desabilitado em ambientes onde h√° switches de outros fabricantes ou onde seguran√ßa √© uma preocupa√ß√£o.

---

## üéØ Objetivo

Configurar as portas de switch para:

- Usar DTP e negociar dinamicamente o trunking.
    
- Ou for√ßar uma porta a trunk ou acesso e evitar negocia√ß√µes autom√°ticas (melhor pr√°tica para seguran√ßa).
    

---

## üìå Modos do DTP

|Modo|Descri√ß√£o|
|---|---|
|`access`|For√ßa a porta a ser modo acesso. DTP desativado.|
|`trunk`|For√ßa a porta a ser trunk. Envia DTP.|
|`dynamic auto`|Espera receber DTP para formar trunk. N√£o envia.|
|`dynamic desirable`|Envia e escuta DTP. Forma trunk se poss√≠vel.|
|`nonegotiate`|For√ßa trunk e desativa DTP (usado com switches que n√£o suportam DTP).|

---

## üõ†Ô∏è Exemplo de Topologia

```
SwitchA ----------- SwitchB
 Fa0/1               Fa0/1
```

---

## üß™ Exemplo de Configura√ß√£o

### üîπ SwitchA - Modo `dynamic desirable`

```bash
SwitchA> enable
SwitchA# configure terminal
SwitchA(config)# interface fastethernet0/1
SwitchA(config-if)# switchport mode dynamic desirable
SwitchA(config-if)# switchport trunk encapsulation dot1q
SwitchA(config-if)# no shutdown
SwitchA(config-if)# exit
SwitchA(config)# exit
```

### üîπ SwitchB - Modo `dynamic auto`

```bash
SwitchB> enable
SwitchB# configure terminal
SwitchB(config)# interface fastethernet0/1
SwitchB(config-if)# switchport mode dynamic auto
SwitchB(config-if)# switchport trunk encapsulation dot1q
SwitchB(config-if)# no shutdown
SwitchB(config-if)# exit
SwitchB(config)# exit
```

> Resultado: Como um lado est√° em `dynamic desirable` e o outro em `dynamic auto`, **o trunk ser√° formado automaticamente**.

---

## üîê Seguran√ßa: Como Desabilitar o DTP

Em portas onde **n√£o se deseja trunking**, desabilite o DTP:

```bash
Switch(config)# interface fastethernet0/2
Switch(config-if)# switchport mode access
Switch(config-if)# switchport nonegotiate
```

---

## üîç Verifica√ß√£o

### Verificar o estado da porta:

```bash
Switch# show interfaces fa0/1 switchport
```

### Verificar se a interface est√° em trunk:

```bash
Switch# show interfaces trunk
```

---

## ‚úÖ Boas Pr√°ticas

- Em ambientes de produ√ß√£o, **evite usar DTP**. Prefira configurar trunk e access estaticamente.
    
- Use `switchport nonegotiate` em trunks com equipamentos que n√£o suportam DTP.
    
- Sempre documente quais portas est√£o em trunk e quais em acesso.
    

---

