
---

# ğŸ“˜ DocumentaÃ§Ã£o: ConfiguraÃ§Ã£o Detalhada do Spanning Tree (STP) com 3 Switches

## ğŸ¯ Objetivo

Evitar loops de camada 2 e garantir redundÃ¢ncia entre switches, utilizando o protocolo Spanning Tree Protocol (STP).

## ğŸ§  Conceitos BÃ¡sicos

- **STP** Ã© um protocolo que impede loops de rede em topologias redundantes.
    
- Ele **desativa automaticamente portas** para formar uma **Ã¡rvore sem ciclos**.
    
- **Bridge ID = prioridade (padrÃ£o 32768) + MAC**
    
- A **Bridge com menor Bridge ID** vira a **Root Bridge**.
    
- Tipos de portas STP:
    
    - **Root Port (RP)**: melhor caminho para a Root Bridge.
        
    - **Designated Port (DP)**: melhor porta para um segmento.
        
    - **Blocked Port**: desativada para evitar loops.
        

---

## ğŸ–§ Topologia (Exemplo)

```
         [SW1] <----- Root Bridge
        /     \
     [SW2]   [SW3]
        \     /
         -------
```

## âœ… PrÃ©-requisitos

- Todos os switches configurados com IPs para gerenciamento (opcional).
    
- ConexÃµes fÃ­sicas entre os switches usando interfaces FastEthernet ou Gigabit.
    
- Acesso ao modo privilegiado dos switches.
    

---

## ğŸ”§ Etapas da ConfiguraÃ§Ã£o

### 1. **Verificar se o STP estÃ¡ ativado**

Nos switches Cisco, STP jÃ¡ vem ativado por padrÃ£o:

```bash
SW1# show spanning-tree
```

---

### 2. **Escolher a Root Bridge (SW1 no exemplo)**

Configure a prioridade do switch SW1 com valor menor (quanto menor, maior a chance de ser Root):

```bash
SW1(config)# spanning-tree vlan 1 priority 4096
```

> Valor padrÃ£o Ã© 32768. Pode usar 4096, 8192, etc.

Nos outros switches, pode deixar o padrÃ£o ou forÃ§ar a nÃ£o ser Root:

```bash
SW2(config)# spanning-tree vlan 1 priority 32768
SW3(config)# spanning-tree vlan 1 priority 32768
```

---

### 3. **Configurar trunk entre os switches**

```bash
SW1(config)# interface range f0/1 - 2
SW1(config-if-range)# switchport mode trunk
```

Repita isso em todas as portas que conectam switches entre si.

---

### 4. **Verificar o status STP**

ApÃ³s conectar os switches:

```bash
SW1# show spanning-tree vlan 1
```

Verifique:

- Qual switch Ã© Root
    
- Quais portas estÃ£o em estado **Forwarding** e **Blocking**
    

---

### 5. **Ajustar PortFast para hosts (nÃ£o switches!)**

```bash
SW(config)# interface f0/10
SW(config-if)# switchport mode access
SW(config-if)# spanning-tree portfast
```

> **Nunca ative PortFast em links entre switches!**

---

## ğŸ” Comandos de VerificaÃ§Ã£o Ãšteis

```bash
show spanning-tree            ! mostra a Ã¡rvore STP
show spanning-tree vlan 1    ! mostra detalhes por VLAN
show interfaces status       ! vÃª quais interfaces estÃ£o ativas
```

---

## ğŸ“Œ Dicas Extras

- Use **RSTP** (modo mais rÃ¡pido) com:
    
    ```bash
    SW(config)# spanning-tree mode rapid-pvst
    ```
    
- Em ambientes com mÃºltiplas VLANs, configure STP por VLAN (`PVST+`):
    
    ```bash
    SW(config)# spanning-tree vlan 10 priority 4096
    SW(config)# spanning-tree vlan 20 priority 8192
    ```
    

---
